[
  {
    "id" : "4b17ca2b-1a93-479e-82bf-3af5fd8c3158",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/4b17ca2b-1a93-479e-82bf-3af5fd8c3158",
    "created_at" : "Wed Oct 09 19:16:29 UTC 2019",
    "company" : "Table XI",
    "company_url" : "https://www.tablexi.com/",
    "location" : "Chicago",
    "title" : "Full Stack Software Developer",
    "description" : "<p><strong>What We're Looking For</strong></p>\n<p>Table XI looks for team members who can see both the forest and the trees. Developing great products is about being equally concerned with building the right thing as building it well.</p>\n<p>As a senior full stack developer at Table XI, we'd want you to:</p>\n<ul>\n<li>\n<p>Lead projects, provide technical guidance, identify risks, proactively learn and share, and mentor more junior team members.</p>\n</li>\n<li>\n<p>Expertly develop both back-end and front-end code</p>\n</li>\n<li>\n<p>Understand client's business, build relationships with clients, and guide strategic decisions to make client successful</p>\n</li>\n<li>\n<p>Communicate professionally and empathetically, solicit and provide feedback, actively offer help, and make sure everyone is aligned</p>\n</li>\n<li>\n<p>Guide architecture and implementation discussions, help unblock other developers, establish best practices for maintainability, and strategically balance test coverage, risk and budget</p>\n</li>\n<li>\n<p>Take responsibility (even when no one asks)</p>\n</li>\n<li>\n<p>Work collaboratively on a cross-functional team of developers, designers, and business analysts.</p>\n</li>\n<li>\n<p>Learn from everyone, no matter what their title is.</p>\n</li>\n</ul>\n<p>If you’re curious, talented and hungry, we want to hear from you.</p>\n<p><strong>Our Tech Stack</strong></p>\n<ul>\n<li>\n<p>Back-end: we primarily create applications in Ruby on Rails, though we have a small number of applications with other setups: Elixir and Phoenix, Node and Sails or Express, and even some old Perl apps.</p>\n</li>\n<li>\n<p>Front-end: we either use Bulma or craft CSS from scratch following the ideas of ITCSS. For Javascript, we generally use React, though we have some apps that use Stimulus for when React is too big of a hammer.</p>\n</li>\n<li>\n<p>Mobile: we support native iOS development in both Objective-C and Swift. These days, though, almost all of our apps are being built in React Native.</p>\n</li>\n<li>\n<p>Infrastructure: nearly all of our infrastructure is on AWS and managed by Terraform and chef. We are in the process of migrating to Docker containers in Kubernetes (EKS).</p>\n</li>\n</ul>\n<p>Don't hesitate if you don't have specific experience with our tech stack. We have a preference for folks with Ruby on Rails experience, but if you’re a strong developer with experience in related tools, we want to hear from you!</p>\n<p><strong>Who We Are</strong></p>\n<p>At Table XI, our product is our people. To deliver the best solutions, we need as many bright and diverse minds in the room as possible, and we need to be able to learn from them once they’re there. That’s why we’re working to create an environment that’s comfortable and inclusive for everyone. We know the tech industry isn't always as welcoming as it should be. But we're happy to do the work of making it better, both at our company and in our community.</p>\n<p>Our team is important to us and we're excited to have been recognized as both one of Built in Chicago's 50 Best Small Companies to Work For in Chicago 2019 and Inc. Magazine's America's Best Workplaces of 2019.</p>\n<p><strong>Our Approach</strong></p>\n<p>For 16 years, we've built our software development consultancy around three small words and one big idea: tech done right. To us, it means more than clean code and sound design. It means doing right by our partners, by our peers and by our community.</p>\n<p>We’re a curious and humble group of people who love to build things. Learning is the key to our culture, and we’re always looking for new skills to pick up and ways to hone our craft. We bring that same curiosity to our clients, digging into their needs so we can make sure our design and development projects look great, work great and push client businesses forward. Our clients look to us as a strategic partner, and we make decisions that affect their long-term success.</p>\n<p><strong>We've Helped</strong></p>\n<ul>\n<li>\n<p>Northwestern University research facilities perform and advance clinical research</p>\n</li>\n<li>\n<p>AccuWeather prototype and design new features for their weather applications</p>\n</li>\n<li>\n<p>Tyson Foods deploy Design Thinking methods to create one of Time magazine's top 10 smartest, most sustainable products of 2018</p>\n</li>\n<li>\n<p>More than 25,000 people participate in Chicago Ideas Week each year</p>\n</li>\n<li>\n<p>Pharmaceutical companies ensure that medicines and vaccines are manufactured and stored properly</p>\n</li>\n<li>\n<p>PechaKucha build a global community of storytellers, in over 1100 cities around the world</p>\n</li>\n<li>\n<p>Roger Ebert solidify his legacy as a film critic</p>\n</li>\n</ul>\n<p>But the work is just part of what makes Table XI a fun place to be. We make time for people to follow their interests, whether that's volunteering at Code Platoon, speaking at RailsConf, learning a new framework or writing books. If there's something you're passionate about, we want to help you pursue it so you can teach it to the rest of us. Our weekly Lunch and Learns have covered everything from an X-Files approach to design, React/Redux basics, culinary skills for home cooks, to website performance testing.</p>\n<p><strong>Everyone on Our Team Enjoys</strong></p>\n<ul>\n<li>\n<p>Daily gourmet meals cooked in-house with vegetarian, gluten-free, and other options available</p>\n</li>\n<li>\n<p>The promise of minimal travel</p>\n</li>\n<li>\n<p>A casual loft office that pairs an open floor plan with quiet rooms</p>\n</li>\n<li>\n<p>Competitive salary</p>\n</li>\n<li>\n<p>Aetna health insurance</p>\n</li>\n<li>\n<p>401k plan, including employer matching</p>\n</li>\n</ul>\n<p><strong>We Take Equality Seriously</strong></p>\n<p>Table XI is proud to be an equal opportunity workplace and is committed to equal opportunity employment without regard to race, religion, color, gender (including gender identity, change of sex and transgender status), sexual orientation, age, disability, ancestry, national origin, military or veteran status, marital status, genetic information or any other characteristic protected by applicable law.</p>\n<p>All offers of employment are conditioned upon the candidate’s completion of a Form I-9 and delivery of appropriate documentation to establish the candidate’s identity and legal authorization to work in the United States.</p>\n",
    "how_to_apply" : "<p>Apply here: <a href=\"https://tablexi.bamboohr.com/jobs/view.php?id=20\";>https://tablexi.bamboohr.com/jobs/view.php?id=20<;/a></p>\n",
    "company_logo" : "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDkwIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a0a542ad87474a6e974fea0c1622df64a402917b/tableXI_logo_large.jpg"
  },
  {
    "id" : "26e6766b-6f5e-4b78-8277-637514cf32b3",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/26e6766b-6f5e-4b78-8277-637514cf32b3",
    "created_at" : "Wed Nov 06 17:55:24 UTC 2019",
    "company" : "City of Plano",
    "company_url" : "http:",
    "location" : "City of Plano, Plano, Texas",
    "title" : "Full Stack Developer/Integrator II",
    "description" : "<p>At the City of Plano, our values make us who we are and guide us as we SERVE our city.&nbsp; As members of&nbsp;Team Plano, our organizational Values (what is most important to us) make up the acronym,&nbsp;SERVE&nbsp;(Stewardship&nbsp;Engaged&nbsp;Respectful&nbsp;Visionary&nbsp;Excellence).&nbsp;</p>\n<p>Summary of Duties: &nbsp;Under general supervision, works with business partners within one or more business processes to align technology solutions with business strategies. Supports one or more moderately complex business processes; serves as a team member.</p>\n<p>EXAMPLES OF ESSENTIAL JOB FUNCTIONS</p>\n<p>Management reserves the rights to add, modify, change, or rescind the work assignments of different positions and to make reasonable accommodations so that qualified employees can perform the essential functions of the job.</p>\n<p>Establishes and maintains liaison relationships with business partners and TS to provide effective technical solutions; seeks opportunities to improve business relationships.\nCreates and maintains system models, specifications, diagrams, and charts to provide direction to teams.\nDevelops user test cases and validates test results during testing; executes test cases and test units; may validate application functionality after OS level updates.\nInvestigates, resolves, and escalates problems; may recommend solutions and identify need for technical assistance to aid in problem resolution; informs clients of problems, issues, and resolutions; ensures IT solutions meet client needs.\nProvides assistance in determining the need for a change requests; may implement changes.\nKeeps clients informed of problems, issues, and resolutions.\nCoaches and transfers knowledge to less experienced team members.\nParticipates in, and may lead peer programing sessions; participates in established code review processes and procedures; initiates team code review as needed.\nConducts research on hardware and software products to justify recommendation and support purchasing efforts.\nPerform best coding practices with comments, naming conventions, code structure, and mitigating security risks.\nCompetent in programming and debugging across multiple modules and dealing with related external dependencies.\nMay research and implement new and emerging languages, frameworks, and technologies for solutions when appropriate.\nConducts end user training; writes well defined end user documentation including but not limited to solution user manuals; may review or establish end user training curriculum and end user documentation for completeness.\nProvides system and application administration and support to multiple platforms used to develop solutions in accordance with operational management guidelines.\nWrites code that consumes one or more API end points; authors API end points for multiple applications; may engineer one or more applications and services.\nFields incoming issues and problem tickets from end-users to resolve application and software issues within servers, databases, and other mission critical application systems.\nRecords, tracks, and documents problem solving processes through resolution.\nAssists in maintaining and enhancing performance of all new and existing software and applications across the organization; tests fixes and performs post-resolution follow-ups to ensure problems have been adequately resolved.\nPosts software updates, drivers, knowledge bases and frequently asked question resources on company intranet to assist in problem resolution.\nPerforms preventative maintenance including the installation of service packs, patches, hot fixes, anti-virus, and related software.\nPerforms other duties as assigned.\nWorks with business partners within one or more business processes to align technology solutions with business strategies.\nRegular and consistent attendance for the assigned work schedule is essential.&nbsp;\nMarginal Duties:</p>\n<p>Performs other duties as assigned.\nTypical Decisions:</p>\n<p>Responds to problem statements and questions from internal and external business partners by developing custom applications, websites, and mobile apps. Determines technical needs of end-users and provides appropriate guidance.</p>\n<p>Minimum Qualifications:</p>\n<p>Knowledge of: Agile/Scrum Methodology; Design principles and best practices regarding UX/UI; Mobile app development in iOS (Swift), Android (JAVA), or utilizing a cross-platform solution such as Xamarin, PhoneGap or React Native.</p>\n<p>Skill in: Communicating effectively both verbally and in writing; programming and debugging across multiple modules and dealing with related external dependencies.</p>\n<p>Programming languages, frameworks, and technologies used in the environment such as HTML, JavaScript, CSS, NodeJS, C#, Python, AngularJS, Aurelia, SQL, PHP, AWS Aurora, AWS Lambda, AWS CodePipline, and others.&nbsp;</p>\n<p>Education: Bachelor’s degree in computer science or related field; or four years of related experience.</p>\n<p>Experience: Six (6) years of experience as an Application Integrator/Developer or related field.</p>\n<p>Any work-related experience resulting in acceptable proficiency levels in the above Minimum Qualifications is an acceptable substitute for the above specified education and experience requirements</p>\n<p>Licenses and Certifications: Texas Class C driver’s license may be required.</p>\n<p>AWS Certified Developer Associate</p>\n<p>CompTIA Security+ or MTA Security and</p>\n<p>Any one of the following:</p>\n<p>CompTIA Network+\nCompTIA Server+\nMTA Networking\nMTA Server\nEither one of the following:</p>\n<p>MCSA Web Applications\nMCSA Universal Windows Platform\nConditions of Employment:&nbsp;&nbsp; Must pass a drug test, driver’s license check if license required, criminal history background check, periodic CJIS background check (for positions requiring access into Police buildings) and social security number verification check.</p>\n<p>Physical Demands and Working Conditions:</p>\n<p>This is primarily an office classification although standing in work areas and walking between work areas may be required. Finger dexterity is needed to access, enter, and retrieve data using a computer keyboard or calculator and to operate standard office equipment; vision to read printed materials and a computer screen; hearing and speech to communicate in person and over the telephone. Positions in this classification occasionally bend, stoop, kneel, reach, push, and pull drawers open and closed to retrieve and file information. Employees must possess the ability to lift, carry, push, and pull materials and objects weighing up to 25 pounds.</p>\n<p>Employees work in an office environment with moderate noise levels, controlled temperature conditions, and no direct exposure to hazardous physical substances. Employees may interact with upset staff and/or public and private representatives in interpreting and enforcing departmental policies and procedures.</p>\n<p>The above statements are intended to describe the general nature and level of work being performed and are not intended to be an exhaustive list of all responsibilities, duties and skills which may be required. The position also requires meeting the essential requirements of the Physical Demands and Working Conditions, with or without reasonable accommodation.</p>\n<p>Equal Opportunity Employer - EOE/M/F/V/D</p>\n<p>Open positions are subject to close without notice.</p>\n",
    "how_to_apply" : "<p><a href=\"https://plano.gov/585/Team-Plano-Careers\";>https://plano.gov/585/Team-Plano-Careers<;/a></p>\n<p>Job Opening ID: 219399</p>\n",
    "company_logo" : null
  },
  {
    "id" : "2c967b75-c9df-49fe-9221-3aa8288c6d8b",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/2c967b75-c9df-49fe-9221-3aa8288c6d8b",
    "created_at" : "Wed Dec 12 10:57:48 UTC 2018",
    "company" : "OTTO (GmbH & Co KG)",
    "company_url" : null,
    "location" : "Hamburg, Deutschland",
    "title" : "Agile iOS Developer Otto.de (w/m/divers) | Team Apps",
    "description" : "<p>Direkt auf dem OTTO-Campus in Hamburg die Zukunft des E-Commerce vorantreiben. Wir investieren in neue Technologien und in die Weiterentwicklung unserer Plattform <a href=\"https://www.otto.de/\";>otto.de</a>. Unsere Leidenschaft leben wir täglich in vielseitigen Teams. Sei Teil der Zukunft, an der wir gemeinsam arbeiten. Bist du bereit? Dann bewirb' dich jetzt!\nWir, das Apps-Team (ca. 8-10 Kollegen), sind verantwortlich für die iOS und Android Apps von OTTO. Mit über 2 Millionen aktiven Installationen und durchschnittlich 4,8 von 5 Sternen machen unsere Apps mittlerweile rund 20 % des Umsatzes von otto.de aus. Unsere hybride iOS App wurde komplett in Swift entwickelt (derzeit Swift 4.2) und soll durch dich noch nativer werden. Als Team treffen wir Technologie- und Architekturentscheidungen eigenverantwortlich und sind von der Konzeption bis zum Betrieb der Features überall dabei.</p>\n<p><strong>DAS BRINGT DER JOB</strong>:</p>\n<ul>\n<li>Du entwickelst Features in der hybriden App, nativ sowie im WebView unter Anbindung diverser APIs</li>\n<li>Als Developer unterstützt du den gesamten Software-Lifecycle: Du entwirfst, programmierst, sorgst für gute Software-Qualität und übernimmst eigenständig Verantwortung für den Betrieb der App</li>\n<li>Du bringst eigene Ideen ein, nutzt den Freiraum in deren Umsetzung und lieferst täglich Mehrwert für unsere Kunden</li>\n<li>In deinem crossfunktionalen Team arbeitest du mit den Methoden der agilen Softwareentwicklung und bringst dich ein, dein Team kontinuierlich weiter zu entwickeln</li>\n<li>Im Austausch mit den anderen Teams und den Stakeholdern erarbeitest du fachliche und technische Anforderungen und konzipierst Lösungen dafür</li>\n</ul>\n<p>Hast du weitere Fragen? – Wende dich an <a href=\"mailto:Lars.Lentfer@otto.de\">Lars.Lentfer@otto.de</a> oder triff uns auf einem der <a href=\"https://www.meetup.com/de-DE/CocoaHeads-Hamburg/\";>CocoaHeads-Meetups</a>!</p>\n<p><strong>DAS BRAUCHEN WIR</strong>:</p>\n<ul>\n<li>\n<strong>Must-have</strong>: sehr gute Kenntnisse in der Entwicklung von Swift, Hybrid Apps; ein agiles Mindset; Lust auf agile Methoden (zum Beispiel TDD, Collective Code Ownership); Interesse an Pair Programming</li>\n<li>\n<strong>Nice-to-have</strong>: Kenntnisse und Erfahrungen mit Objective-C, REST, MVVM, Reactive(Swift|Cocoa), Testflight, Fastlane, eCommerce, Cloud-Umgebungen (idealerweise AWS), NoSQL-Datenbanken (bspw. MongoDB), Java, DevOps</li>\n</ul>\n<p><strong>DAS BIETEN WIR</strong>:</p>\n<ul>\n<li>Viel Freiraum, um neue, innovative Technologien auszuprobieren und einzuführen</li>\n<li>Experten-Know-how und Gestaltungsspielraum, auch was deine persönliche und fachliche Entwicklung betrifft</li>\n<li>Besuch (internationaler) Fachkonferenzen wie der WWDC</li>\n<li>Innovative Arbeitswelten und flexible Arbeitszeiten (Gleitzeit, 37,5-Stunden-Woche)</li>\n<li>Leistungsstarkes MacBook Pro aktueller Generation</li>\n<li>Und wir bieten <a href=\"https://www.otto.de/unternehmen/jobs/arbeitswelt/benefits.php\";>noch mehr</a>\n</li>\n</ul>\n",
    "how_to_apply" : "<p>Lust auf den Job? – Dann sende deine Bewerbung an <a href=\"mailto:vivian.musfeldt@otto.de\">vivian.musfeldt@otto.de</a>. Mit der Zusendung deiner Daten stimmst du der weiteren Verarbeitung deiner Daten bei OTTO (GmbH &amp; Co KG) zu. Hier findest du unsere Datenschutzinformationen: <a href=\"https://www.otto.de/unternehmen/de/datenschutz.php\";>https://www.otto.de/unternehmen/de/datenschutz.php<;/a></p>\n",
    "company_logo" : "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcHRaIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--264383d8fc559da0154c3c019f9e3dda5509f32f/Otto_Logo_300dpi_jpg.jpg"
  },
  {
    "id" : "e96002f8-6daf-40ae-b253-393a9b2e971f",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/e96002f8-6daf-40ae-b253-393a9b2e971f",
    "created_at" : "Fri Nov 01 16:33:46 UTC 2019",
    "company" : "Trade Republic",
    "company_url" : "https://traderepublic.com",
    "location" : "Berlin, Germany",
    "title" : "iOS Engineer",
    "description" : "<h2>Trade Republic is Europe’s first commission-free mobile broker.</h2>\n<p>We offer easy, fast and convenient access to capital markets for everyone.</p>\n<p>With a German banking license and partners such as HSBC, Blackrock and solarisBank, we make stock trading dead simple and commission-free.</p>\n<p>We believe brokerage is poised for disruption driven by technology and automation. We have developed a proprietary banking platform operating for a fraction of the cost of traditional banks.</p>\n<h2>What you'll be doing</h2>\n<ul>\n<li>work with our 100% Swift codebase, following an MVVM pattern and developing features in an agile environment</li>\n<li>take proactive responsibility for the long-term code quality and architecture, with a focus on writing clean and sustainable code</li>\n<li>collaborate with our existing team members with decisions around architecture and code structure-</li>\n<li>have a strong impact within our small mobile development team</li>\n</ul>\n<h2>What we look for</h2>\n<ul>\n<li>you have a passion for a great UX and UI and you are keen to work closely with our designers to achieve this</li>\n<li>you are comfortable with Swift and the basics of reactive programming</li>\n<li>you enjoy working in an agile environment and have a self-driven personality with a “hands-on” approach</li>\n<li>you can identify and solve problems independently and efficiently</li>\n</ul>\n<h2>Tech Stack</h2>\n<ul>\n<li>100% Swift 5.1</li>\n<li>ReactiveSwift/ReactiveCocoa</li>\n<li>UIKit and programmatic Auto Layout</li>\n<li>CoreGraphics and CoreAnimation</li>\n<li>Carthage</li>\n<li>WebSockets with a custom protocol, that bridges the reactive contract over the network</li>\n</ul>\n",
    "how_to_apply" : "<p>Email your resume to <a href=\"mailto:join@traderepublic.com\">join@traderepublic.com</a> or apply directly at <a href=\"https://traderepublic.com/careers/#iOS-engineer\";>https://traderepublic.com/careers/#iOS-engineer<;/a></p>\n",
    "company_logo" : "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcEIyIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0bc567b41639c57704f88d48634b1e521b07f29c/Clip%205.png"
  },
  {
    "id" : "0276f45a-0355-4d81-84b8-fe498cc5377f",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/0276f45a-0355-4d81-84b8-fe498cc5377f",
    "created_at" : "Wed Oct 23 14:59:13 UTC 2019",
    "company" : "Reaktor",
    "company_url" : "https://reaktor.com/careers/",
    "location" : "Lisbon",
    "title" : "Fearless Team Builder and Software Developer",
    "description" : "<p>We at Reaktor are known for changing how the world works. Owned by our employees and known for <a href=\"https://www.youtube.com/watch?v=qvGrmAFiijY\";>an award-winning culture</a> and a  <a href=\"https://www.geektime.com/2017/03/30/finlands-reaktor-plans-first-network-of-lunar-satellites-as-nasa-esa-lay-groundwork-for-moon-infrastructure/\";>Node.js running satellite</a>, the next phase of our global story is about to begin – right here in Lisbon. <strong>We are looking for a skilled developer with unmatched team-building skills that wants to be a founding character in our Portuguese story.</strong></p>\n<p><strong>From a five-person team to a global culture: How we got here</strong></p>\n<p>Ok, ok, before we get ahead of ourselves – here’s a brief history. Reaktor was born in Helsinki, Finland, when five developers joined forces to build themselves a workplace and a tech community like no other. That was eighteen years ago.</p>\n<p>Now, we’re a 500-strong community of engineers, designers, strategists based in Helsinki, Amsterdam, New York City, Stockholm, Tokyo, Dubai…and soon, Lisbon. In the past two years we have, for example, trained over 2% of the Finnish population in the <a href=\"https://www.elementsofai.com/\";>basics of AI</a>, built a solution to compensate the carbon emissions of <a href=\"https://www.instagram.com/p/B1dnXPbBnnn/\";>an entire music festival weekend</a>, and made Fast Company’s list of <a href=\"https://www.fastcompany.com/company/reaktor\";>Most Innovative Companies</a>.</p>\n<p><strong>Common sense approach to not-so-common problems is our superpower</strong></p>\n<p>Our actual business, where our €$¥ comes from, is consulting companies to whom new tech is a matter of life and death. In practice, this means working in teams of three to five Reaktorians and building elegant solutions to our clients’ most complex technology problems. Companies like Adidas, Air France-KLM, Heineken, and others trust our teams to design, develop, and launch their new services.</p>\n<p><strong>We’ll expect our Lisbon pioneers to:</strong></p>\n<ul>\n<li>Find, choose, and mentor their colleagues.</li>\n<li>Write beautiful code. We have no hard language or tech requirements – we know that good developers can create great things in any language.</li>\n<li>Join us in Helsinki and Amsterdam for onboarding, planning, project work, and client meetings, according to your availability and desire to travel.</li>\n<li>Be a team player, through and through, and shape the team by leading by example.</li>\n<li>Have interest or experience in some of the following buzzwords: functional programming, state management, Node.js, Clojure, React, Swift, Kotlin, SQL and NoSQL, Kanban.</li>\n</ul>\n<p>Look. We know that for many engineers, just focusing on the code would be easier. However, what we are looking for is a person who likes to code, but is also interested in keeping in touch with clients, enjoys taking care of team members, and takes responsibility of things that no one else is into.</p>\n<p><strong>Sound like that’s you? Here’s what happens when you hit Apply:</strong></p>\n<p>💻Brief video chat, just to say hi.</p>\n<p>👋🏽<strong>Introduction to Reaktor.</strong> We call this the Culture and Attitude interview. Here’s Adam to tell you more about <a href=\"https://www.reaktor.com/blog/magical_fairy_land/\";>what to expect from our interviews</a>.</p>\n<p>😎 <strong>Technical interview.</strong> No brain teasers or sorting algos, we promise! You choose a couple of topics to discuss, we choose a couple of topics to discuss.</p>\n<p>📃 <strong>Closing interview.</strong> We clarify our mutual expectations of our common future. Naturally, necessities like compensation and equipment will be taken care of in a manner that satisfies us both.</p>\n<p>❤️ That’s it, welcome to the crew &lt;3</p>\n",
    "how_to_apply" : "<p>So, <a href=\"https://www.reaktor.com/blog/a-letter-from-your-future-colleague-alex/\";>dear future colleague</a>: please apply, we’re waiting for your email at <a href=\"mailto:careers-nl@reaktor.com\">careers-nl@reaktor.com</a>. This is your chance to make something truly exceptional happen in Lisbon with us.</p>\n",
    "company_logo" : "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbmgxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--9b96d0bd8df8b0d2bc5a1918b6ebe6f86d7cb845/reaktor_logo_1000px_transparent.png"
  },
  {
    "id" : "dbc59368-523c-455c-ab85-8f4e634e5dc1",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/dbc59368-523c-455c-ab85-8f4e634e5dc1",
    "created_at" : "Wed Oct 23 14:49:07 UTC 2019",
    "company" : "Reaktor",
    "company_url" : "https://reaktor.com/careers/",
    "location" : "Lisbon",
    "title" : "Software Engineer With a Twist",
    "description" : "<p>Curious about applying your tech skills in different domains?\nPlanning and theory are important but the most value is in the execution?\nPassionate about your hobbies, your friends are asking you to shut up already?\nKeep finding yourself in heated discussions about the latest features in your favorite programming language?</p>\n<p>Well, look at you sounding like a Reaktorian already 😎</p>\n<p>At Reaktor, we design and build tomorrow’s digital products. Owned by our employees and known for <a href=\"https://www.youtube.com/watch?v=qvGrmAFiijY\";>an award-winning culture</a> and a <a href=\"https://www.geektime.com/2017/03/30/finlands-reaktor-plans-first-network-of-lunar-satellites-as-nasa-esa-lay-groundwork-for-moon-infrastructure/\";>Node.js running satellite</a>, the next phase of our global story is about to begin – right here in Lisbon.</p>\n<p>👫 <strong>We make our clients succeed in technology</strong> .</p>\n<p>Reaktor teams work in close co-operation with our clients. Delivering anything from automating beer brewing processes and scaling the streaming of popular TV shows (hint: winter is coming!), to refining global scale ecommerce services and building 100kLOC JS codebases from scratch.</p>\n<p>Basically, we strive to tackle the most exciting and complex tech problems out there. Your job is to solve them in meaningful, future-forward ways, in a small team of some of the sharpest minds around. If it runs code, our team of propeller-heads can make it.</p>\n<p>👩‍💻 <strong>Sound like your future team? This is what we want from you:</strong></p>\n<ul>\n<li>Curiosity to apply your tech skills to different domains.</li>\n<li>Getting things done is what gives you energy. The best part of the day is when the code gets deployed to production. Even when it’s not perfect yet.</li>\n<li>You see colleagues and clients as individuals with their respective strengths and weaknesses.</li>\n</ul>\n<p>📟 <strong>Technically speaking, this is what we offer</strong></p>\n<ul>\n<li>We use the best tools for the job at hand. Sometimes it’s Clojure running in a Kubernetes cluster, and sometimes it’s a small piece of JS running on AWS Lambda.</li>\n<li>Sometimes tech is best solved with no code at all, but with talking to the right people.</li>\n<li>Our juniors and seniors alike work on both the shiny and dirty bits of the codebase. No ivory tower architects here.</li>\n<li>Some buzzwords we are into: functional programming, state management, Node.js, Clojure, TypeScript, React, Swift, Kotlin, SQL and NoSQL, Kanban,</li>\n<li>We have no hard language or tech requirements, as we know that good developers can create great things in any language.</li>\n</ul>\n<p><strong>Here’s what happens when you Apply:</strong></p>\n<p>💻Brief video chat, just to say hi.</p>\n<p>👋🏽<strong>Introduction to Reaktor.</strong> We call this the Culture and Attitude interview. Here’s Adam to tell you more about <a href=\"https://www.reaktor.com/blog/magical_fairy_land/\";>what to expect from our interviews</a>.</p>\n<p>😎 <strong>Technical interview.</strong> No brain teasers or sorting algos, we promise! You choose a couple of topics to discuss, we choose a couple of topics to discuss.</p>\n<p>📃 <strong>Closing interview.</strong> We clarify our mutual expectations of our common future. Naturally, necessities like compensation and equipment will be taken care of in a manner that satisfies us both.</p>\n<p>❤️ That’s it, welcome to the crew &lt;3</p>\n",
    "how_to_apply" : "<p>So, <a href=\"https://www.reaktor.com/blog/a-letter-from-your-future-colleague-alex/\";>dear future colleague</a>: apply, we’re waiting for your email at <a href=\"mailto:careers-nl@reaktor.com\">careers-nl@reaktor.com</a>. This is your chance to make something truly exceptional happen in Lisbon with us.</p>\n",
    "company_logo" : "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBblYxIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--08153304fcf604551b3c15b4cd3305e7ecfcf827/reaktor_logo_1000px_transparent.png"
  },
  {
    "id" : "312b993e-ec09-11e8-9f79-994c27d575a7",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/312b993e-ec09-11e8-9f79-994c27d575a7",
    "created_at" : "Mon Nov 19 14:42:19 UTC 2018",
    "company" : "Signify",
    "company_url" : null,
    "location" : "Eindhoven",
    "title" : "Mobile Application Tester",
    "description" : "<p><strong>We are…</strong>\nSignify, the new company name of Philips Lighting, is the undisputed leader in the lighting industry. Our purpose is to unlock the extraordinary potential of light for brighter lives and a better world.</p>\n<p>You will join the leader in the lighting industry and learn through disruptive challenges. You will be part of a global team, where performance is powered through diversity. Help us shape the future of light in the Internet of Things and work with us on our commitment to achieve a more sustainable future.</p>\n<p>Join us and #findyourmeaning at Signify.</p>\n<p>Since its launch in 2012, Philips Hue is changing the way people interact and experience lighting.</p>\n<p>We have become the world’s leading connected home lighting system that works with all major smarthome platforms (Amazon Alexa, Apple HomeKit, Google, Nest, Smartthings). Philips Hue has encouraged other companies to develop devices, apps and systems that inter-operate with our system.\nThrough a vibrant developer program there are more than 600 third-party apps for Philips Hue. The Hue ecosystem is growing rapidly through both new lights, luminaires, sensors, and switches as well as exciting partnerships like Google and Apple. New features are added through agile development processes.</p>\n<p>As a Mobile App tester in the Hue mobile Application Team, you will be challenged to release the Hue Mobile Apps on time with highest quality, further contributing to the success of one of the most successful internet connected propositions in the market. Being member of an agile team, you will seek for continuous improvement and accelerate the development of the product whilst focusing on operational excellence by using or implementing new tools and processes.</p>\n<p>You will be based at the High-Tech Campus Eindhoven, the smartest square km in Europe, joining a team of passionate software craftsmen working on the world’s leading connected lighting system. Surrounded by usability experts, product owners, software architects and test engineers, you’ll take up the challenge to build high quality and exciting innovations providing the best lighting experience for our customers.</p>\n<p><strong>Together we can…</strong></p>\n<ul>\n<li>Develop test scenarios for new features based on user story requirements Support developers with implementation of test scenarios into the test automation framework Support test architect with introduction of test strategies for new features</li>\n<li>Maintain and improve test scenarios for existing features</li>\n<li>Support the development of new features by verifying the user stories in an exploratory way</li>\n<li>Execute manually test scenarios</li>\n<li>Create problem reports and change requests</li>\n<li>Support developers with root cause analyses of bugs</li>\n<li>Verify and validate problem reports, team up with developers</li>\n<li>Validate and release sprint deliverables towards system test group and beta testing</li>\n<li>Report status to product owner and test architect</li>\n<li>Review deliverables of requirements and test cases of peers</li>\n<li>Adhere with processes (including tools, build process) and contribution in process improvements in both own and related project teams</li>\n<li>collaborate with all roles in the development team</li>\n<li>Follow up technical developments in own field and share proactively with others in the team</li>\n</ul>\n<p><strong>You are…</strong>\nA software test engineer developer with good communication skills and quality mindset that is continuously seeking to improve together with the team, the product and daily processes and has passion for Mobile Application Development engineering and innovations in that area. Next to that, you have:</p>\n<ul>\n<li>At least three years’ experience in testing mobile apps</li>\n<li>Good analytical skills with attention for detail</li>\n<li>Able to understand complex technical systems</li>\n<li>Familiar with testing methodologies in agile environment including exploratory testing.</li>\n<li>Experience with writing detailed test scenarios based on available specifications</li>\n<li>Owner of an ISTQB or TMAP certificate or having similar level of test knowledge by experience</li>\n<li>Knowledge of platform specific IDE’s (Apple Xcode, Android Studio) is a plus</li>\n<li>Knowledge of platform specific UI test automation frameworks (Espresso, EarlGrey) is a plus</li>\n<li>Basic knowledge of platform specific languages (Swift, Kotlin) is a plus</li>\n<li>Knowledge of behavior driven testing based on Gherkin terminology is a plus</li>\n<li>Experience in an IoT or systems environment is a plus</li>\n</ul>\n<p><strong>Our offer…</strong>\nWhen joining Signify, you will be part of a global leader with a start-up spirit. We welcome you to a challenging, innovative environment with great opportunities for you to explore. Our benefits are very competitive and designed around your preferences:</p>\n<ul>\n<li>Extensive set of tools to drive your career including personal development budget and coaching</li>\n<li>Healthy work-life balance</li>\n<li>25 Days of leave and the possibility to purchase up to 20 extra days off annually</li>\n<li>A bonus based on both Signify results and personal performance</li>\n<li>Solid company pension scheme and attractive collective health insurance package</li>\n<li>Opportunity to buy Signify shares and products with discount</li>\n</ul>\n<p><strong>Interested?</strong>\nPlease apply online via this link: <a href=\"https://philips.redirect.your-jobresponse.com/m/236879/V819/apply\";>Click here to apply!</a></p>\n<p>Agency calls not appreciated</p>\n",
    "how_to_apply" : "<p><a href=\"https://philips.redirect.your-jobresponse.com/m/236879/V819/apply\";>Click here to apply!</a></p>\n",
    "company_logo" : "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDVYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d2bbd3e2e0303af4f19e5d133e2701e4ebffa6cb/ceee070f-98a0-4980-aed6-ed76ddacc987"
  },
  {
    "id" : "011d0efa-ec02-11e8-9627-49b976c98ef2",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/011d0efa-ec02-11e8-9627-49b976c98ef2",
    "created_at" : "Mon Nov 19 13:50:36 UTC 2018",
    "company" : "Signify",
    "company_url" : "http://www.philips.com",
    "location" : "Eindhoven",
    "title" : "Mobil Application Developer iOS",
    "description" : "<h2>We are…</h2>\n<p>Signify, the new company name of Philips Lighting, is the undisputed leader in the lighting industry. Our purpose is to unlock the extraordinary potential of light for brighter lives and a better world.</p>\n<p>You will join the leader in the lighting industry and learn through disruptive challenges. You will be part of a global team, where performance is powered through diversity. Help us shape the future of light in the Internet of Things and work with us on our commitment to achieve a more sustainable future.</p>\n<p>Join us and #findyourmeaning at Signify.</p>\n<p>Since the launch of in 2012, Philips Hue is changing the way people interact and experience lighting.\nWe have become the world’s leading connected home lighting system that works with all major smarthome platforms (Amazon Alexa, Apple HomeKit, Google, Nest, Smarthings). Philips Hue has encouraged other companies to develop devices, apps and systems that interoperate with our system. Through a vibrant developer program there are more than 700 third-party apps for Philips Hue.</p>\n<p>As a mobile app developer in the Philips Hue mobile app development team, you will work on world-class mobile app technology and push the boundaries of what’s possible with connected lighting products.</p>\n<p>You will be based at the High Tech Campus Eindhoven, the smartest square km in Europe, joining a team of passionate software craftsmen working on the world’s leading connected lighting system. Surrounded by usability experts, product owners, software architects and test engineers, you’ll take up the challenge to build high quality and exciting innovations providing the best lighting experience for our customers.</p>\n<h2>Together we can…</h2>\n<ul>\n<li>Develop new features for Hue from end to end through prototyping, validation, implementation, launch, and further iteration in an agile environment</li>\n<li>Develop and implement key parts of the Hue iOS application</li>\n<li>Work alongside an excellent, cross-functional team, you will build technical solutions that enables continuous delivery and provides exciting new functionality with the highest quality</li>\n<li>Keep abreast of technical developments in own field and proactive knowledge sharing with others</li>\n<li>Challenge yourself to do better every day and have fun while doing so</li>\n</ul>\n<h2>You are…</h2>\n<p>A highly driven developer with a passion for mobile apps, who:</p>\n<ul>\n<li>Has at least 3 years of experience and excellent coding skills in Objective-C and Swift.</li>\n<li>Has a deep knowledge of the iOS SDK and IDE development tools</li>\n<li>Can show off published apps in the Apple AppStore</li>\n<li>Has solid understanding of the agile development process and experience with TDD is a plus</li>\n<li>Cross platform development and test automation experience is a plus</li>\n</ul>\n<h2>Our offer …</h2>\n<p>When joining Philips Hue, you will be part of a global leader with a start-up spirit. We welcome you to a challenging, innovative environment with great opportunities for you to explore. Our benefits are very competitive and designed around your preferences:</p>\n<ul>\n<li>Extensive set of tools to drive your career including personal development budget and coaching</li>\n<li>Healthy work-life balance</li>\n<li>25 Days of leave and the possibility to purchase up to 20 extra days off annually</li>\n<li>A bonus based on both Signify results and personal performance</li>\n<li>Solid company pension scheme and attractive collective health insurance package</li>\n<li>Opportunity to buy Signify shares and products with discount</li>\n</ul>\n<h2><strong>Interested?</strong></h2>\n<p>Please apply via this link: <a href=\"https://philips.redirect.your-jobresponse.com/mobil_application_developer_ios_eindhoven/236861/V819/apply\";>Click here to apply!</a></p>\n",
    "how_to_apply" : "<p><a href=\"https://philips.redirect.your-jobresponse.com/mobil_application_developer_ios_eindhoven/236861/V819/apply\";>Click here to apply!</a></p>\n",
    "company_logo" : "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGRYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--df388b637d19b0f1760a9ae2ae2c43f1f56be1db/7c96c6e8-b036-4808-a0c2-6ee7b8007013"
  },
  {
    "id" : "6087faee-e298-11e8-9e1d-f95949c20e77",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/6087faee-e298-11e8-9e1d-f95949c20e77",
    "created_at" : "Wed Nov 07 14:22:29 UTC 2018",
    "company" : "Attest",
    "company_url" : "http://www.askattest.com",
    "location" : "London",
    "title" : "Engineering Manager",
    "description" : "<p>We’re on the look-out for a seasoned Engineering Manager to lead and empower our team of creative engineers in identifying and delivering features, systems and products they’re proud of. As our first Engineering Manager, this is a greenfield opportunity that will see you having immediate impact from day one. You’ll be trusted to:</p>\n<p><strong>Attract top engineering talent.</strong> You’ll play an integral part in hiring Attest’s engineers by actively sourcing (either via channels such as LinkedIn, relevant events/ meet-ups etc), interviewing, and assessing high-quality candidates for exemplary technical chops, culture-add, potential, and emergent leadership traits.</p>\n<p><strong>Develop our engineers.</strong> We’ll support you in enabling our team of engineers to deliver their greatest work to date by designing meaningful work that encourages personal and professional growth. You’ll do this by mentoring and coaching them during regular 1:1s, as well as performance and development conversations; embedding continual feedback loops for not only course-correction but praise and acknowledgement.</p>\n<p><strong>Lead our engineering team.</strong> You’ll dutifully galvanise the engineering team by communicating a clear, exciting mission and purpose that we’re all aligned on. You’ll work closely with our Technology Director to help shape Attest’s engineering strategy, and translate that to the wider engineering team through context and scene-setting; enabling them to autonomously collaborate on finding solutions.</p>\n<p>You’ll enable our engineers to ship high-value, high-quality features regularly by acting as a conduit for information by working cross-functionally across departments: always aware of relevant activities in other teams; attending product reviews etc. All the while, you’ll be thinking ahead to ensure we are appropriately structured and adequately resourced to achieve our plans in the near, medium and longer terms.</p>\n<p><strong>Retain members of our engineering team.</strong> You’ll play an integral part in driving a high-performing engineering team by ensuring the its members are engaged in the work they produce and feel their contribution makes a genuine difference not just to the company but our users.</p>\n<p><strong>Culture advocate.</strong> You’ll be trusted to enable the team to identify and solve unique problems. To do this, we need your help in building upon our culture of psychological safety, trust, experimentation, and innovation.</p>\n<p><strong>Who you are</strong></p>\n<ul>\n<li>A people person with an engineering background with  a passion for working with and developing engineers at different stages of their profession career;</li>\n<li>An individual with an incredibly high level of EQ – you’ll be fascinated with learning about people on an ongoing basis. Your role will require you to express compassion and empathy and understanding, as well as work effectively with individuals of varying seniority levels, backgrounds and experiences;</li>\n<li>Approachable and accessible to all members of the team - a trusted confidant, great listener, and trouble-shooter;</li>\n<li>An inspiring communicator with an acute ability to know when to appropriately switch from supportive and encouraging to prescriptive;</li>\n<li>Ability to manage conflict and devise swift resolution;</li>\n<li>Adaptable – you’ll be comfortable context-switching multiple times, as there’ll be a variety of tasks and activities you’ll need to effectively and efficiently juggle during the day;</li>\n<li>Enthusiastic about working in a culture of testing and code review;</li>\n<li>Passionate about technology, and excited about being hands-on where necessary, but highly motivated about bringing out the best in our engineers by coaching and mentoring them.</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>Experienced building user-centric digital products, with an awareness of complex user interfaces development, distributed systems and technologies across our stack: Java / Go / TypeScript / Node / SQL (Postgres) / AWS</li>\n<li>You will have proven leadership skills, with experience line managing a high-performing team</li>\n<li>Commercial acumen – being able to understand the market and our users as well as the commercial implications and impact our products have on their lives</li>\n</ul>\n<p><strong>What we’ll offer in return</strong></p>\n<ul>\n<li>A competitive salary that fairly recognises your experience and potential</li>\n<li>An equipment budget to spend on the right tools to help you do your best work\n25 days paid holiday – we care about our team’s wellbeing, so getting enough rest to recharge is vital</li>\n<li>Flexible working hours and working from home</li>\n<li>£900 Growth &amp; Development budget to spend on the resources and tools that will help you grow in your role</li>\n<li>10% adventure time to invest in charitable things, or side projects for Attest</li>\n<li>A values-led working environment that encourages putting people first, honesty, curiosity and leadership</li>\n</ul>\n<p><strong>About our people and culture</strong></p>\n<p>With our team, we take a human-first approach, optimising for joy and adventure (ingrained in everything we do).</p>\n<p>We’re a very flat, friendly, non-hierarchical team. You’ll be working with an experienced commercial and technical team that delivers and adapts the Attest platform to continuously evolve and delight every client and every user.</p>\n<p>We value putting people (our team, clients and consumers) first; honesty, curiosity, empowerment and leadership are core to our team working style. Decisions are made with careful and quick consideration at Attest, to support fast and efficient growth. You can learn more about Attest on our website.</p>\n<p><strong>About Attest</strong></p>\n<p>Great companies put consumers and data at the heart of every decision. Attest makes that simple and open for anyone at every business, continuously, at global scale.</p>\n<p>We call it Scalable Intelligence. Through our platform, hundreds of companies of all sizes connect to networks of 100 million consumers across 80 different countries, to learn, grow and innovate better every day.</p>\n<p>Clients like Unilever, Fever-Tree, EE, Publicis and Twitter rely on Attest to learn more about their consumers, markets and competitors. They use Attest to develop new products, test creatives, measure their brand, gain real-time feedback on trends and make better decisions, faster.</p>\n<p>We’re backed by leading VCs, including Oxford Capital and Episode 1 (investors behind LoveFilm, Zoopla, Betfair, Shazam, CarWow and many other greats), plus several high-powered amazing Angel investors.</p>\n",
    "how_to_apply" : "<p>Please submit your application via this link: <a href=\"https://team.askattest.com/jobs/139761-engineering-manager\";>https://team.askattest.com/jobs/139761-engineering-manager<;/a> Feel free to email <a href=\"mailto:careers@askattest.com\">careers@askattest.com</a> if you have any questions.</p>\n",
    "company_logo" : "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1pXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d3736f7a28b084e631d978b685d41fdff31bad0f/292a96a0-15e6-40fe-b25a-cfe1954fd730"
  },
  {
    "id" : "a412770a-e1d3-11e8-8b9f-cf224f66af92",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/a412770a-e1d3-11e8-8b9f-cf224f66af92",
    "created_at" : "Tue Nov 06 14:54:06 UTC 2018",
    "company" : "moovel Group GmbH",
    "company_url" : "https://www.moovel.com/de/DE",
    "location" : "Berlin",
    "title" : "Backend Engineer (f/m) Node.js",
    "description" : "<p>Transit Squad seeks Backend Engineer (f/m)</p>\n<p>Hi,\nwe’re the transit team at moovel. We build services, munch data and process real-time information in all things transit - and we’re looking for a backend engineer in the Berlin office to\njoin us in our effort to provide great public transit APIs as one of the pillars for moovel’s rapidly expanding mobility platform.</p>\n<p>FIRST A QUICK LOOK AT US\nOur vision is a planet without traffic jams. Our mission is to transform cities by providing the most convenient and sustainable mobility solutions. We create outstanding products with technical excellence, an agile mindset, an open feedback and failure culture and fun at work. moovel is part of a large global corporation (Daimler AG), but at the heart of it we still are a startup. We act as a partner for cities, transport networks and mobility service providers with the goal of making cities smarter and creating an operating system for urban mobility that provides access to appropriate mobility options in urban areas and paves the way for the future with autonomous vehicles. Currently, 250 employees work in small creative teams in Germany and the US at four locations - Hamburg, Berlin, Stuttgart and Portland.</p>\n<p>HOW THE ROLE WORKS\nWe gather in small engineering teams organized around specific topics. The individual teams enjoy a high degree of autonomy, trust and responsibility. Innovation is key and very much encouraged and embraced in our teams. We value pragmatism, simplicity and collaboration. We live an open feedback and failure culture, because we know that both are necessary to find proper solutions.</p>\n<p>With us you’ll use state of the art technology and work self-determined in small, autonomous and agile teams. moovel tries to maintain a culture where engineers are provided with the tools\nof their choice and a friendly environment in which they can thrive.</p>\n<p>SOME OF THE THINGS YOU WILL DO\nTeams at moovel choose the tools they regard as best fit for their problems, at their discretion. Hence the technology stack is rather diverse. We employ a microservice backend architecture based on Docker and AWS. Cloud Services are leveraged wherever they help us to focus on our task. We practice Continuous Delivery and value DevOps culture (you build it, you run it). On the Frontend (IOS, Android and Web) we adopted and embraced Technologies like Swift, Kotlin, Rx or React.</p>\n<p>Breaking down concrete tasks for this position is not that easy, but that's what makes it so exciting. Here are some things we want to entrust you right away:</p>\n<ul>\n<li>You write, monitor, scale and architect microservices that comprise our transit backend</li>\n<li>You build infrastructure and tooling for importing data into our data stores</li>\n<li>You develop services using Node.js &amp; Python</li>\n<li>You perform analysis to enable data driven decisions</li>\n<li>You write processing pipelines in Python</li>\n<li>Collaborate with cross-functional teams to define, design and ship new features</li>\n</ul>\n<p>ABOUT YOU\nYou should have experience in writing, maintaining &amp; debugging web services. You should be concerned about quality and maintainable code. Some exposure to functional programming, async concepts and micro services would be useful. While having working experience in the Node.js or Python web stack is a plus, it’s not a show-stopper in case you’re flexible and well versed in alternatives like Rails or Play. Since we are working in a rapidly evolving environment you should be open to pick up new languages, tools and frameworks. Furthermore, we are working with Amazon Web Services so it would be good if you are familiar with cloud technologies and methodologies like 12 Factor.</p>\n<p>You should be familiar with SQL. Additionally, it would be nice if you have experience with any of Elasticsearch, Lucene, Solr or similar search technologies. </p>\n<p>As it is our corporate language, you should have good written and verbal communication skills in English.</p>\n<p>BENEFITS</p>\n<ul>\n<li>Choose your own hardware</li>\n<li>Working with newest technologies &amp; microservices</li>\n<li>Company pension plan</li>\n<li>Free breakfast, coffee &amp; water</li>\n<li>Mobility allowance</li>\n<li>Be part of an interdisciplinary team of experts</li>\n<li>Working on products with a high impact on society</li>\n<li>International teams</li>\n<li>Child care allowance</li>\n<li>Flexible working hours</li>\n</ul>\n<p>Sounds good?\nWe are more than happy to meet you soon! Just click the application form.</p>\n<p>Your Transit Squad\nMagnus, Engineering Manager Search</p>\n<p>Click here for the application!</p>\n<p>If you have any questions or are in need for further information feel free to contact\nJanosch Fingerhut\n+49 30 549073811</p>\n",
    "how_to_apply" : "<p>Click here for the application!</p>\n",
    "company_logo" : "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbTFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f3516d50eaf556f5817391b6fa7484e24bfe85f1/412aec9a-9ac1-46bd-b50f-c0bbafeb2d09"
  },
  {
    "id" : "547b8a96-dc5c-11e8-97cc-5b8cae901903",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/547b8a96-dc5c-11e8-97cc-5b8cae901903",
    "created_at" : "Tue Oct 30 15:56:14 UTC 2018",
    "company" : "reBuy reCommerce GmbH",
    "company_url" : "http://rebuy.de",
    "location" : "Berlin, Germany",
    "title" : "Senior Mobile Developer | iOS",
    "description" : "<p><strong>Company Description</strong></p>\n<p>TECH @ reBuy reCommerce GmbH</p>\n<p>We are looking for the best people to be part of our adventure and create\nan enjoyable, focused and challenging environment which results in great\nculture, we live and enjoy everyday. Our small teams work closely together\nand can solve even the toughest business problems and find the best\npossible solution for our customers.\nAt reBuy TECH we believe that user experience depends on the software we\ndesign, which is why the code needs to excel. The whole architecture should\nbe fun to use, fast, rock solid and simply state of the art. Of course we\nalso know good code can only be created by great and happy people. In order\nto be good, you need to feel comfortable at work. We push hard to make work\nequal fun and challenging so you reach new heights.</p>\n<p><strong>Job Description</strong></p>\n<p>Mobile is a constantly growing part of our customer facing product and our\nambition is to provide mobile customers with the best possible experience.\nJoin our mobile apps team implementing new features, maintaining and\ntesting our iOS app throughout its lifecycle. Be part of a flourishing team\nthat is self-motivated and takes decision based on data, research and\ncustomer feedback. Contribute with your mobile know-how and bring our app\nto new quality heights. Play an active role on building an awesome\nreCommerce application that you are proud of.\nWant to build the greatest reCommerce iOS app currently available? We will\nbe happy to have you on board!</p>\n<p><strong>Qualifications</strong></p>\n<p>We expect that you have solid Swift experience, understand the ins and outs\nof iOS and what great features each new versions brought. You are used to\nutilize design patterns like MVVM to keep everything tidy and you are aware\nthat ReactiveX is not a chemistry formula. Writing tests is something you\nembrace and love doing, whilst moving fast forward. You feel comfortable\ncreating and maintaining your application APIs in PHP or bring the appetite\nto do so :)</p>\n<p>Compiled:</p>\n<ul>\n<li>You have solid Swift experience</li>\n<li>In-depth knowledge of iOS 9 to 11 that enables you to create\ncompelling features for our customers</li>\n<li>Awareness of design patterns (e.g. MVVM) and software principles (e.g.\nInversion of control)</li>\n<li>ReactiveX is a standard for you, RxSwift experience is a huge plus</li>\n<li>Fluent in writing unit tests</li>\n<li>Familiar with RESTful APIs to connect iOS applications to back-end\nservices</li>\n<li>Android development experience is an advantage</li>\n</ul>\n<p><strong>Additional information</strong></p>\n<p>We are offering a unique job in an innovation-friendly company within an\ninspiring and flourishing environment. We always want you to be productive\nin your way. Before you join you can choose your state of the art hardware:\nAlthough our eco system is built around linux/mac, we don't care whether\nyou run Mac, Linux or Windows. Our atmosphere is open-minded: Something you\nwant to change or something to introduce? Let’s talk about it! The projects\nhave a broad scope for codecision-making. Our goals are ambitious and they\nwill lead us to exciting paths. So pick your favorite career, apply with a\npleasing CV and we will get back to you as quick as possible! For\ninternationals we provide relocation assistance.</p>\n<p>Get to know the reBuy TECH team, our Tryday and our projects on: <strong><a href=\"https://tech.rebuy.com/\";>TECH @\nreBuy</a></strong></p>\n",
    "how_to_apply" : "<p>How to Apply: <a href=\"http://smrtr.io/P6L8\";>http://smrtr.io/P6L8<;/a></p>\n",
    "company_logo" : "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--e72a6990d74d0b29b7279f390a2630d1b6512a76/5b0dce1a-e6b1-4342-9670-167b76f12e90"
  },
  {
    "id" : "83470dde-dc50-11e8-8176-9238b892b788",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/83470dde-dc50-11e8-8176-9238b892b788",
    "created_at" : "Tue Oct 30 14:32:03 UTC 2018",
    "company" : "A Color Story",
    "company_url" : "http://acolorstory.com",
    "location" : "Remote",
    "title" : "Mobile Developer",
    "description" : "<p>As a company, we are a small, tight-knit family where everyone’s ideas are heard and matter. We’re looking for someone excited by a fast pace and problem solving to grow with our little company. This position will work within our existing code structures under the guidance of our lead mobile developer.</p>\n<p><strong>What you’ll do</strong></p>\n<ul>\n<li>Oversee ongoing maintenance and updates to A Color Story, A Design Kit, and future products</li>\n<li>Implement new filter/effects packs and tools</li>\n<li>Consistently look for improvements and further optimizations</li>\n<li>Test, test, test, ship, repeat</li>\n</ul>\n<p><strong>What we need from you</strong></p>\n<ul>\n<li>3+ years building complex, scalable mobile or web applications or educational equivalent</li>\n<li>Extensive understanding of object orientation and design patterns</li>\n<li>Ample experience with Objective C and/or Swift as well as Java</li>\n<li>Self-starting personality that thrives in a minimal management environments</li>\n</ul>\n<p><strong>What we prefer from you</strong></p>\n<ul>\n<li>BS/BA in a technical field such as Computer Science</li>\n<li>Self-made apps in the App Store a huge plus</li>\n<li>Understanding of image processing</li>\n<li>Experience with OpenGL or Metal</li>\n<li>Interest in photography and a mobile photo editing app user</li>\n<li>Startup experience</li>\n</ul>\n<p><strong>What we offer</strong></p>\n<p>Competitive salary, flexible PTO</p>\n<p><strong>Location</strong></p>\n<p>Company based in Springfield, MO, USA, but remote is available.</p>\n<p><em><strong>Must be located in North or South America.</strong></em></p>\n",
    "how_to_apply" : "<p>Email your resume and links to apps you've worked on to <a href=\"mailto:hello@acolorstory.com\">hello@acolorstory.com</a>.</p>\n",
    "company_logo" : null
  },
  {
    "id" : "c37e8b54-d555-11e8-8730-c2f34a443e55",
    "type" : "Full Time",
    "url" : "https://jobs.github.com/positions/c37e8b54-d555-11e8-8730-c2f34a443e55",
    "created_at" : "Sun Oct 21 17:25:33 UTC 2018",
    "company" : "DevsData",
    "company_url" : null,
    "location" : "Oslo, Norway",
    "title" : "Senior Full-Stack JavaScript Engineer/Tech Lead with Node, React & TypeScript",
    "description" : "<h2>[Senior Full-Stack JS Engineer/Tech Lead with Node &amp; React needed!]</h2>\n<p>Join the team of ex-Googlers!</p>\n<ul>\n<li>Full-time (40h a week)</li>\n<li>Location: Oslo, Norway (relocation required)</li>\n<li>$70 - $140 an hour</li>\n<li>Duration: 12+ months (permanent employment / long-term contract)</li>\n<li>Start: beginning of December 2018 (negotiable)</li>\n<li>3-4 people with this profile are needed</li>\n<li>Accommodation cost in Oslo is covered by the company</li>\n</ul>\n<p>Yet another time we search for extraordinary specialists to join our nerdy crew! :)</p>\n<p>Project for a big retail corporation in Norway (12k employees) with stores across entire Europe.</p>\n<p>You’ll be working closely with business people (including ex-McKinsey partner with 20 years of business experience; Harvard graduate), IT specialists (SE architects, DevOps, UI/UX people), marketing/sales department, Machine Learning/Artificial Intelligence professionals, QA, logistics department and product manager to design, prioritize, and build new IT products in fashion, retail/e-commerce sectors related to a digital transformation that is happening in the organization.</p>\n<p>One of the most important products that will need to be build is a new ecommerce platform (think: Zalando competitor) as well as information/data exchange platform for physical stores and IT tools for supply chain optimisation.</p>\n<p>The role is a fast-paced environment that involves above-average degree of tech &amp; business conceptual thinking, swiftness, communication &amp; people skills and ecommerce/retail understanding. Ideal candidate can present a work history for well-known brands, some startup world experience (we’re lean and move quickly), min 2 years of similar commercial experience on a similar position.</p>\n<p>If you are looking for an easy next project/job, or quick cash - there are better offers out there.</p>\n<p>Basic algorithmic experience and problem solving absolutely required - if you're strong in JS/React, but struggle at algo or data structures, don't bother applying.</p>\n<p>A rare, exciting opportunity to hone industry-related, practical business know-how, system design skills and work/network with top-notch world-class professionals (we already relocated people from the US and Canada for this project; people with Harvard and Google on their CVs).</p>\n<p>Initial tech stack (likely to be refined, but not totally changes):\n️- Front-End: JS, TypeScript, React, Vue, MobX.js, Redux, Web Assembly, Sharing components, PWA, Jest, Mocha, Karma\n️- Back-End: mainly - NodeJS and serverless, but also: GoLang, Python, grpc, RabbitMQ, Celery, Redis, Nginx*, HAProxy, Varnish HTTP cache\n️- DevOps: Kubernetes, Ansible, Docker, Prometheus, Grafana, ELK, Fluentd, Collectd, Terraform, Helm, New Relic, Sentry, secret management tools, InfluxDB, Telegraf, Swagger*\n️- FaaS: OpenFaas, Serverless, AWS Lambda*, Fission, Syncano</p>\n<p>The most important are: JS, TypeScript, React &amp; Node</p>\n<p>Requirements</p>\n<p>️- Previous involvement in building large IT product totally from scratch</p>\n<p>️- Wide-range of technologies that you're comfortable using (ideally covering majority of tools mentioned in this offer, and especially strong in JS environments including Node and React)</p>\n<p>️- Minimum 1 year of professional experience on commercial projects and similar position (tech lead / senior FE/JS engineer)</p>\n<p>️- Minimum 7 years of commercial, hands-on IT experience in total</p>\n<p>️- International experience</p>\n<p>️- Fluent English communication skills</p>\n<p>️- Being up to date with recent tech tools &amp; frameworks, extensive overall IT knowledge</p>\n<p>️- Willingness to relocate to Oslo</p>\n<p>Big pluses:</p>\n<p>️- Studied Computer Science at a prestigious university - e.g. Harvard, Oxford, Cambridge, MIT, Stanford, Wharton, Berkeley (or top universities in your country)</p>\n<p>️- Worked or contracted to well-know brands and corporations e.g. Google, Palantir, Hedge Funds, Amazon, eBay, Microsoft, Goldman Sachs (joking, GS is actually a minus :)), Intel, Nvidia</p>\n<p>️- Work experience also from the fast-paced startup world</p>\n<p>️- Worked with a distributed/remote team before</p>\n<ul>\n<li>\n<p>Excellent communication skills</p>\n</li>\n<li>\n<p>Business understanding / product skills</p>\n</li>\n</ul>\n<p>️- If you consider yourself a nerd :) and are passionate about the technology, that's a big plus</p>\n",
    "how_to_apply" : "<p><a href=\"mailto:tomasz@potanski.pl\">tomasz@potanski.pl</a></p>\n",
    "company_logo" : "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3hYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0f39a1718b69f374b4decee135d579c6b376e4f4/24236f93-1354-4eef-9265-ef08a743ba6b"
  }
]
